#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f4c19b99-1b93-4b30-8459-dc5f67f09b5c]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a945a059-e500-41b2-a1eb-798c84d64496]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6186826e-0702-48ee-bfae-847c8b67d072]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=afe014e5-29d0-426f-b2af-cae103589616]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7044b073-873e-4b19-baf3-4e0c295f31d1]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ba038e4-4352-4f96-ab46-efe34535e276]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f72ca209-e380-4974-b74f-bd72db220429]
module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8c49c59-f256-4909-9167-23e1cd3c8cf3]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=43c46c41-8645-4382-8d88-f95446db22d6]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d8518d23-4192-40f8-bf23-1913653d3f1c]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ba3fd16f-02d2-4965-9d31-badd88b976dd]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=708c2ebd-7026-4ae4-a874-1d1e7cb56c73]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=34812da4-8682-4c47-bbb7-0be93e103bf5]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=418a76f5-b7f6-4a16-be87-545c01f58fae]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4f44e715-e095-4b31-85dc-e7da82c4a457]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3414e5fb-1170-498b-9bfd-0666d1058923]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a3f12175-e290-4ace-8766-fd2ada9df7ac]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b0179020-af50-4192-9ab8-934a09d3be5d]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fa3cb140-469e-4037-a509-dfa1640d1a24]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f2652350-2af4-42a6-bd34-5d728810eabc]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6b1928c5-63d9-42dd-ab56-ead99e67d95e]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6f3fdb25-195a-469b-93aa-c59f47eaf3c5]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=390da2e5-8a83-4c72-87ba-ba1677541d85]
module.keycloak_test.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c58385f-893b-4be9-844e-6552bb27e107]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a6c96df3-f033-4d6d-a783-56c6dd4c9798]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=84390d01-fa70-4c93-b3ad-227c06f93f53]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fa982f3b-6466-466e-a23f-952320e8002c]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3ac43a9-4f4f-40f8-a7e8-05b501c8a1c0]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=307db575-47cd-4541-b31a-9120bd646f59]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=157f8322-6d35-447e-9d58-72c4c22cda30]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=27a43bbe-2898-4daf-bb38-2d619b7bd0a0]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c8e3c129-6965-46cf-8ea5-cb16e2029edd]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9014021e-84a5-4c3a-9e44-12421dd62d16]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dca48610-5d98-4b53-889b-a397e932cb0f]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bd8f7908-7bc2-4854-9a50-6336cdc9a3dd]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3a95e88c-b9e5-457d-bf4f-2a1b6e682e8f]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ca1cc7e-d2c8-48d9-95e5-ae601fdf4ba8]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7d1dc4c2-48f6-4eb1-bbcb-254b2f7f2a07]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f4c6f769-1f1d-420f-a170-f7e8ca2f30ca]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f265e64-4ce9-4dcd-8714-3d94383b7e92]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=22710518-fb5d-4a1a-97e7-289e2201f5ca]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fc6ccd25-143b-4d0b-b08c-d0ce1e9e4aeb]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=08e12a5d-fe3f-46e1-be77-ae495f968d09]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=28305938-567f-475b-ab55-0b3d4944e023]
module.keycloak_test.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=93b22c88-d4c6-4d92-a7e5-0a4a415b98de]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=783e1e1b-eee7-4e79-b7e3-644c69bd1c25]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4394a341-74bd-43c0-be66-0f7f51ab1179]
module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=51a8196c-67da-40ed-bcf1-11c7f535d28d]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=480d6c00-75a5-40b2-8004-7fc6d16c996d]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fc340de4-9ec4-4e56-9b13-14c35eef9f20]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=0d3cb042-4415-4ec2-85f2-a7842c735ba4]
module.keycloak_test.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d824633c-0013-4ac9-975e-77532bea4ff7]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d30cd9ba-b0ec-40fc-a6c6-3bbc320e82a8]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a02511e-ee3f-41ab-ab18-879f6a4668b8]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9a9a72df-dc1e-4b03-ab2d-9d0b8f869849]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5b509105-1006-4af4-a6b1-e4aabea28bfa]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a40e70fa-078d-4d39-bee6-89e22adbc6a1]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e19c2955-61a6-45bf-be99-f70500d770f5]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b5eecca9-8296-4e83-87e1-2d3ed2d12889]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eacdc94e-44cc-46b7-afa2-66c49675bd87]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1da9e266-dd95-417a-bfae-f22b917858ab]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0c4ce51-d011-418b-97a4-0c53588cd5b2]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=391c2063-0c69-45df-99b0-3ae47305dc56]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bdf91e60-31fc-4c74-b5c2-fd31e06ca4d6]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=136a65c5-4e06-4aa0-85fd-1fdf7c0fb7d5]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=edd32336-e9dd-43a8-ab45-5e195c99bcc6]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=741b8f35-6a0e-4b37-b5d6-3d0135b4d72b]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94acaf0e-7e43-45ca-b24d-8736b48189d6]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95664d1a-79e3-4960-af7a-1e6803529631]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d3c11471-1b80-40ff-a18e-e5e87a701a21]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4202b7e3-0ce7-437e-b083-3e3e41acb395]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=80a768ca-f8cb-4813-9c45-5e3a51476972]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f47953b-12ba-4f95-b703-a4240b2025d2]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f014a65b-f015-482a-884e-18f257ebdd3b]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5388f7f1-9800-489f-8072-d83fcfbc43f5]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d449e594-e091-435f-aca2-b03849703896]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=26f898b3-2452-4764-9f3a-833f3b79c90a]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cd192d0a-0723-44fd-872b-0df7a004c787]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63ba2f70-5b54-4299-a638-2e66b1caba54]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7e3f9e8c-c5a1-48c6-ab24-bf6531fcccff]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7bb6acb1-8a21-4052-b0cc-0f62cece49c8]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=614dac07-8e3d-4581-90bc-55c855829de8]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc774e55-0fc5-41e6-a4f0-360c898f1296]
module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22fcfb4b-929f-418c-8df4-2ac5df373a7d]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=acfa69d8-7904-4142-8e82-217b60cd9045]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=88d1a623-39ab-42c0-8257-e47b209da2dc]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4b691815-680a-40ef-9e08-df1c9968c0fc]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=25b5beb0-871c-4ca5-8b06-fcf3b629f729]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a8fcd62-601e-4cfc-a547-5ba48fa7e66a]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8878cff1-1348-4e40-ac4c-e86cbef10953]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5e9d717d-3d45-40b0-9afe-b3515c77fd97]
module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8793c98f-faaa-494f-b0d6-f70eddff4110]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8cb41a00-1ca8-45e7-9251-da8615bbc4d0]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63d308e-aa95-4341-88bc-b61f9e1735ec]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95136448-40b2-405f-a0f7-2a54b784b98d]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0f521005-8b3e-458d-924d-ac032a340baf]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=64f4da34-9368-4cea-b47d-b5f0fd4e277c]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=41430063-49d0-45cd-bc9d-256545fc7800]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=722e7cb3-109f-4692-8c64-c5903cc51dcd]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fd58d902-a307-4efe-8051-7d66667e1896]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jan-31-test-team-role-edit-2-4820"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jan-31-test-team-role-edit-2-4820"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "jan-31-test-team-role-edit-2-4820"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jan-31-test-team-role-edit-2-4820"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
      + web_origins                              = [
          + "+",
          + "https:///www.test.ca/devChange",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jan-31-test-team-role-edit-4819"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jan-31-test-team-role-edit-4819"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-4819.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "jan-31-test-team-role-edit-4819"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jan-31-test-team-role-edit-4819"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
      + web_origins                              = [
          + "+",
          + "https:///www.test.ca/devChange",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3366 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*